---
kind: method
id: M:Autodesk.Revit.DB.Structure.StructuralConnectionHandler.GetOrigin
source: html/de922052-21bc-5958-8c4b-d4398ead0a88.htm
---
# Autodesk.Revit.DB.Structure.StructuralConnectionHandler.GetOrigin Method

Retrieves origin point of Structural Connection Handler element.

## Syntax (C#)
```csharp
public XYZ GetOrigin()
```

## Returns
The origin point of element.